
#### :building_construction: Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.tenant["freifunk-troisdorf-126b9c8"].data.netbox_device_interfaces.wan_named[0] will be read during apply
  # (config refers to values not yet known)
 <= data "netbox_device_interfaces" "wan_named" {
      + id         = (known after apply)
      + interfaces = (known after apply)
      + limit      = 1

      + filter {
          + name  = "device_id"
          + value = (known after apply)
        }
      + filter {
          + name  = "name"
          + value = "wan"
        }
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].netbox_device.router[0] will be created
  + resource "netbox_device" "router" {
      + device_type_id = 371
      + id             = (known after apply)
      + name           = "ext-freifunk-troisdorf-126b9c8"
      + primary_ipv4   = (known after apply)
      + primary_ipv6   = (known after apply)
      + role_id        = 58
      + site_id        = 116
      + status         = "active"
      + tags_all       = (known after apply)
      + tenant_id      = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].netbox_ip_address.wan[0] will be created
  + resource "netbox_ip_address" "wan" {
      + description           = "Tunnel endpoint for ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = "213.168.81.93/29"
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.data.netbox_device_interfaces.lo will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "netbox_device_interfaces" "lo" {
      + id         = (known after apply)
      + interfaces = (known after apply)
      + limit      = 1

      + filter {
          + name  = "device_id"
          + value = "677"
        }
      + filter {
          + name  = "name"
          + value = "lo"
        }
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.loopback_v4 will be updated in-place
  ~ resource "netbox_ip_address" "loopback_v4" {
      ~ device_interface_id   = 2274 -> (known after apply)
        id                    = "955"
        tags                  = []
        # (11 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.loopback_v6 will be updated in-place
  ~ resource "netbox_ip_address" "loopback_v6" {
      ~ device_interface_id   = 2274 -> (known after apply)
        id                    = "946"
        tags                  = []
        # (11 unchanged attributes hidden)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.data.netbox_device_interfaces.lo will be read during apply
  # (config refers to values not yet known)
 <= data "netbox_device_interfaces" "lo" {
      + id         = (known after apply)
      + interfaces = (known after apply)
      + limit      = 1

      + filter {
          + name  = "device_id"
          + value = (known after apply)
        }
      + filter {
          + name  = "name"
          + value = "lo"
        }
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_asn.device[0] will be created
  + resource "netbox_asn" "device" {
      + asn         = (known after apply)
      + description = "ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + id          = (known after apply)
      + rir_id      = 12
      + tags_all    = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_available_prefix.site_v4 will be created
  + resource "netbox_available_prefix" "site_v4" {
      + description      = "Site prefix for ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + id               = (known after apply)
      + parent_prefix_id = 96
      + prefix           = (known after apply)
      + prefix_length    = 32
      + site_id          = 116
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_available_prefix.site_v6 will be created
  + resource "netbox_available_prefix" "site_v6" {
      + description      = "Site prefix for ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + id               = (known after apply)
      + parent_prefix_id = 97
      + prefix           = (known after apply)
      + prefix_length    = 56
      + site_id          = 116
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_available_prefix.tunnels_v4["CR3"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR3 to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 60
      + vrf_id           = 1
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_available_prefix.tunnels_v4["CR4"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR4 to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 60
      + vrf_id           = 1
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_available_prefix.tunnels_v4["CR5"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR5 to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 60
      + vrf_id           = 1
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_available_prefix.tunnels_v4["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v4" {
      + description      = "Tunnel from CR6 to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + id               = (known after apply)
      + parent_prefix_id = 126
      + prefix           = (known after apply)
      + prefix_length    = 31
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 60
      + vrf_id           = 1
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_available_prefix.tunnels_v6["CR3"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR3 to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_available_prefix.tunnels_v6["CR4"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR4 to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_available_prefix.tunnels_v6["CR5"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR5 to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_available_prefix.tunnels_v6["CR6"] will be created
  + resource "netbox_available_prefix" "tunnels_v6" {
      + description      = "Tunnel from CR6 to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + id               = (known after apply)
      + parent_prefix_id = 132
      + prefix           = (known after apply)
      + prefix_length    = 64
      + role_id          = 1
      + status           = "active"
      + tags_all         = (known after apply)
      + tenant_id        = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_device_interface.core["CR3"] will be created
  + resource "netbox_device_interface" "core" {
      + description   = "Tunnel to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + device_id     = 21
      + enabled       = true
      + id            = (known after apply)
      + label         = "Tunnel ext-freifunk-troisdorf-126b9c8"
      + mac_address   = (known after apply)
      + mac_addresses = (known after apply)
      + mtu           = 1476
      + name          = (known after apply)
      + tags_all      = (known after apply)
      + type          = "virtual"
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_device_interface.core["CR4"] will be created
  + resource "netbox_device_interface" "core" {
      + description   = "Tunnel to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + device_id     = 22
      + enabled       = true
      + id            = (known after apply)
      + label         = "Tunnel ext-freifunk-troisdorf-126b9c8"
      + mac_address   = (known after apply)
      + mac_addresses = (known after apply)
      + mtu           = 1476
      + name          = (known after apply)
      + tags_all      = (known after apply)
      + type          = "virtual"
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_device_interface.core["CR6"] will be created
  + resource "netbox_device_interface" "core" {
      + description   = "Tunnel to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + device_id     = 607
      + enabled       = true
      + id            = (known after apply)
      + label         = "Tunnel ext-freifunk-troisdorf-126b9c8"
      + mac_address   = (known after apply)
      + mac_addresses = (known after apply)
      + mtu           = 1476
      + name          = (known after apply)
      + tags_all      = (known after apply)
      + type          = "virtual"
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_device_interface.tunnels["CR3"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description   = "Tunnel to CR3"
      + device_id     = (known after apply)
      + enabled       = true
      + id            = (known after apply)
      + label         = "Tunnel CR3"
      + mac_address   = (known after apply)
      + mac_addresses = (known after apply)
      + name          = "tun0"
      + tags_all      = (known after apply)
      + type          = "virtual"
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_device_interface.tunnels["CR4"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description   = "Tunnel to CR4"
      + device_id     = (known after apply)
      + enabled       = true
      + id            = (known after apply)
      + label         = "Tunnel CR4"
      + mac_address   = (known after apply)
      + mac_addresses = (known after apply)
      + name          = "tun1"
      + tags_all      = (known after apply)
      + type          = "virtual"
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_device_interface.tunnels["CR5"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description   = "Tunnel to CR5"
      + device_id     = (known after apply)
      + enabled       = true
      + id            = (known after apply)
      + label         = "Tunnel CR5"
      + mac_address   = (known after apply)
      + mac_addresses = (known after apply)
      + name          = "tun2"
      + tags_all      = (known after apply)
      + type          = "virtual"
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_device_interface.tunnels["CR6"] will be created
  + resource "netbox_device_interface" "tunnels" {
      + description   = "Tunnel to CR6"
      + device_id     = (known after apply)
      + enabled       = true
      + id            = (known after apply)
      + label         = "Tunnel CR6"
      + mac_address   = (known after apply)
      + mac_addresses = (known after apply)
      + name          = "tun3"
      + tags_all      = (known after apply)
      + type          = "virtual"
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_device_primary_ip.v4 will be created
  + resource "netbox_device_primary_ip" "v4" {
      + device_id          = (known after apply)
      + id                 = (known after apply)
      + ip_address_id      = (known after apply)
      + ip_address_version = 4
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_device_primary_ip.v6 will be created
  + resource "netbox_device_primary_ip" "v6" {
      + device_id          = (known after apply)
      + id                 = (known after apply)
      + ip_address_id      = (known after apply)
      + ip_address_version = 6
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_interface.core["CR5"] will be created
  + resource "netbox_interface" "core" {
      + description        = "Tunnel to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + enabled            = true
      + id                 = (known after apply)
      + mtu                = 1476
      + name               = (known after apply)
      + tags_all           = (known after apply)
      + virtual_machine_id = 48
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR3"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of ext-freifunk-troisdorf-126b9c8 for CR3"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
      + vrf_id                = 1
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR4"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of ext-freifunk-troisdorf-126b9c8 for CR4"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
      + vrf_id                = 1
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR5"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of ext-freifunk-troisdorf-126b9c8 for CR5"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
      + vrf_id                = 1
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.local_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v4" {
      + description           = "Peer address of ext-freifunk-troisdorf-126b9c8 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
      + vrf_id                = 1
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR3"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of ext-freifunk-troisdorf-126b9c8 for CR3"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR4"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of ext-freifunk-troisdorf-126b9c8 for CR4"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR5"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of ext-freifunk-troisdorf-126b9c8 for CR5"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.local_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "local_tunnel_address_v6" {
      + description           = "Peer address of ext-freifunk-troisdorf-126b9c8 for CR6"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.loopback_v4 will be created
  + resource "netbox_ip_address" "loopback_v4" {
      + description           = "Loopback address for ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.loopback_v6 will be created
  + resource "netbox_ip_address" "loopback_v6" {
      + description           = "Loopback address for ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR3"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR3 for ext-freifunk-troisdorf-126b9c8"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
      + vrf_id                = 1
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR4"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR4 for ext-freifunk-troisdorf-126b9c8"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
      + vrf_id                = 1
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR5"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR5 for ext-freifunk-troisdorf-126b9c8"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "virtualization.vminterface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
      + vrf_id                = 1
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.remote_tunnel_address_v4["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v4" {
      + description           = "Peer address of CR6 for ext-freifunk-troisdorf-126b9c8"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
      + vrf_id                = 1
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR3"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR3 for ext-freifunk-troisdorf-126b9c8"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR4"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR4 for ext-freifunk-troisdorf-126b9c8"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR5"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR5 for ext-freifunk-troisdorf-126b9c8"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "virtualization.vminterface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_ip_address.remote_tunnel_address_v6["CR6"] will be created
  + resource "netbox_ip_address" "remote_tunnel_address_v6" {
      + description           = "Peer address of CR6 for ext-freifunk-troisdorf-126b9c8"
      + id                    = (known after apply)
      + interface_id          = (known after apply)
      + ip_address            = (known after apply)
      + nat_outside_addresses = (known after apply)
      + object_type           = "dcim.interface"
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_prefix.loopback_v6 will be created
  + resource "netbox_prefix" "loopback_v6" {
      + description = "Loopback prefix for ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + id          = (known after apply)
      + prefix      = (known after apply)
      + site_id     = 116
      + status      = "active"
      + tags_all    = (known after apply)
      + tenant_id   = 60
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_vpn_tunnel.core["CR3"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR3 to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR3-ext-freifunk-troisdorf-126b9c8"
      + status          = "active"
      + tags_all        = (known after apply)
      + tunnel_group_id = 7
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_vpn_tunnel.core["CR4"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR4 to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR4-ext-freifunk-troisdorf-126b9c8"
      + status          = "active"
      + tags_all        = (known after apply)
      + tunnel_group_id = 7
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_vpn_tunnel.core["CR5"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR5 to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR5-ext-freifunk-troisdorf-126b9c8"
      + status          = "active"
      + tags_all        = (known after apply)
      + tunnel_group_id = 7
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_vpn_tunnel.core["CR6"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR6 to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR6-ext-freifunk-troisdorf-126b9c8"
      + status          = "active"
      + tags_all        = (known after apply)
      + tunnel_group_id = 7
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_vpn_tunnel_termination.core_device["CR3"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_device" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 175
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_vpn_tunnel_termination.core_device["CR4"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_device" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 176
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_vpn_tunnel_termination.core_device["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_device" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = 816
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_vpn_tunnel_termination.core_vm["CR5"] will be created
  + resource "netbox_vpn_tunnel_termination" "core_vm" {
      + id                           = (known after apply)
      + outside_ip_address_id        = 532
      + role                         = "peer"
      + tags_all                     = (known after apply)
      + tunnel_id                    = (known after apply)
      + virtual_machine_interface_id = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_vpn_tunnel_termination.site["CR3"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = (known after apply)
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_vpn_tunnel_termination.site["CR4"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = (known after apply)
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_vpn_tunnel_termination.site["CR5"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = (known after apply)
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netbox_vpn_tunnel_termination.site["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = (known after apply)
      + id                    = (known after apply)
      + outside_ip_address_id = (known after apply)
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v4["CR3"] will be created
  + resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + device          = 21
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = 1
      + name            = "CR3-ext-freifunk-troisdorf-126b9c8-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = (known after apply)
      + site            = 12
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 2
      + url             = (known after apply)
      + virtualmachine  = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v4["CR4"] will be created
  + resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + device          = 22
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = 1
      + name            = "CR4-ext-freifunk-troisdorf-126b9c8-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = (known after apply)
      + site            = 12
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 2
      + url             = (known after apply)
      + virtualmachine  = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v4["CR5"] will be created
  + resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + device          = (known after apply)
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = 1
      + name            = "CR5-ext-freifunk-troisdorf-126b9c8-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = (known after apply)
      + site            = 60
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 2
      + url             = (known after apply)
      + virtualmachine  = 48
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v4["CR6"] will be created
  + resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + device          = 607
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = 1
      + name            = "CR6-ext-freifunk-troisdorf-126b9c8-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = (known after apply)
      + site            = 12
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 2
      + url             = (known after apply)
      + virtualmachine  = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v6["CR3"] will be created
  + resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + device          = 21
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = 1
      + name            = "CR3-ext-freifunk-troisdorf-126b9c8-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = (known after apply)
      + site            = 12
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 2
      + url             = (known after apply)
      + virtualmachine  = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v6["CR4"] will be created
  + resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + device          = 22
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = 1
      + name            = "CR4-ext-freifunk-troisdorf-126b9c8-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = (known after apply)
      + site            = 12
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 2
      + url             = (known after apply)
      + virtualmachine  = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v6["CR5"] will be created
  + resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + device          = (known after apply)
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = 1
      + name            = "CR5-ext-freifunk-troisdorf-126b9c8-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = (known after apply)
      + site            = 60
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 2
      + url             = (known after apply)
      + virtualmachine  = 48
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.core_v6["CR6"] will be created
  + resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to ext-freifunk-troisdorf-126b9c8 (Brüsseler Straße)"
      + device          = 607
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = 1
      + name            = "CR6-ext-freifunk-troisdorf-126b9c8-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = (known after apply)
      + site            = 12
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 2
      + url             = (known after apply)
      + virtualmachine  = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v4["CR3"] will be created
  + resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to CR3"
      + device          = (known after apply)
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = (known after apply)
      + name            = "ext-freifunk-troisdorf-126b9c8-CR3-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = 1
      + site            = 116
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 60
      + url             = (known after apply)
      + virtualmachine  = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v4["CR4"] will be created
  + resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to CR4"
      + device          = (known after apply)
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = (known after apply)
      + name            = "ext-freifunk-troisdorf-126b9c8-CR4-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = 1
      + site            = 116
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 60
      + url             = (known after apply)
      + virtualmachine  = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v4["CR5"] will be created
  + resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to CR5"
      + device          = (known after apply)
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = (known after apply)
      + name            = "ext-freifunk-troisdorf-126b9c8-CR5-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = 1
      + site            = 116
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 60
      + url             = (known after apply)
      + virtualmachine  = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v4["CR6"] will be created
  + resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to CR6"
      + device          = (known after apply)
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = (known after apply)
      + name            = "ext-freifunk-troisdorf-126b9c8-CR6-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = 1
      + site            = 116
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 60
      + url             = (known after apply)
      + virtualmachine  = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v6["CR3"] will be created
  + resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to CR3"
      + device          = (known after apply)
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = (known after apply)
      + name            = "ext-freifunk-troisdorf-126b9c8-CR3-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = 1
      + site            = 116
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 60
      + url             = (known after apply)
      + virtualmachine  = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v6["CR4"] will be created
  + resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to CR4"
      + device          = (known after apply)
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = (known after apply)
      + name            = "ext-freifunk-troisdorf-126b9c8-CR4-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = 1
      + site            = 116
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 60
      + url             = (known after apply)
      + virtualmachine  = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v6["CR5"] will be created
  + resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to CR5"
      + device          = (known after apply)
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = (known after apply)
      + name            = "ext-freifunk-troisdorf-126b9c8-CR5-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = 1
      + site            = 116
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 60
      + url             = (known after apply)
      + virtualmachine  = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.netboxbgp_session.device_v6["CR6"] will be created
  + resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      + created         = (known after apply)
      + description     = "Tunnel to CR6"
      + device          = (known after apply)
      + display         = (known after apply)
      + export_policies = (known after apply)
      + id              = (known after apply)
      + import_policies = (known after apply)
      + last_updated    = (known after apply)
      + local_address   = (known after apply)
      + local_as        = (known after apply)
      + name            = "ext-freifunk-troisdorf-126b9c8-CR6-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      + remote_address  = (known after apply)
      + remote_as       = 1
      + site            = 116
      + status          = (known after apply)
      + tags            = (known after apply)
      + tenant          = 60
      + url             = (known after apply)
      + virtualmachine  = (known after apply)
    }

  # module.tenant["freifunk-troisdorf-126b9c8"].module.tunnel.random_integer.core_ifnum will be created
  + resource "random_integer" "core_ifnum" {
      + id      = (known after apply)
      + keepers = {
          + "device_id" = (known after apply)
        }
      + max     = 10000
      + min     = 1000
      + result  = (known after apply)
      + seed    = (known after apply)
    }

Plan: 71 to add, 2 to change, 0 to destroy.
```